{
  "preRequisites:11": [
    256
  ],
  "properties:10": {
    "betterquesting:10": {
      "autoclaim:1": 0,
      "desc:8": "在你进行游玩的过程中，随着一声诡异的响声，你的屏幕前会出现“§5你的身体出现了扭曲§r”字样。这说明你的“心智”中扭曲值增加了。\n\n扭曲不是什么好东西，它会时不时为你施加一些奇奇怪怪的Debuff,扰乱你的游戏进程并影响你的注意力，在下文，玩家被扭曲所影响的事件称为“扭曲发作”。\n\n扭曲发作会根据你的扭曲值（临时+普通+永久）产生不同的效果，它们多半是坏的，但不排除有一些好的效果出现：\n提示“那片嘈杂声是怎么回事？有什么东西在尾随着你……”\n 持续250秒，每15点扭曲值增加1级（最多3级）的咒流效果，并提示“你身上涌出古怪的疲乏感。”\n\n一次性：解锁净化浴盐，并提示“肯定有什么办法可以遏制这些头疼事！”\n 每1点扭曲值增加0.5秒的1级玄癔效果，并提示“你的胃突然发出异常古怪的咕咕声。”\n 持续250秒，每15点扭曲值增加1级（最多3级）的反常之饥效果，并提示“突如其来的反常饥饿感让你感到劳累。”\n\n提示“有什么东西在尾随着你……”\n\n生成1只邪术守卫，并提示：“浓雾凭空而生，其间鬼影绰绰。”\n\n每1点扭曲值增加0.5秒的视瞻昏渺高度近视效果\n 持续250秒，每15点扭曲值增加1级（最多3级）的日之辱蔑效果，并提示“光线突然变得明亮起来，不可抗拒，你的皮肤开始燃烧。”\n 持续60秒，每15点扭曲值增加1级（最多3级）的挖掘疲劳效果，并提示“突然间，你厌倦了破坏。”\n 持续300秒，每15点扭曲值增加1级（最多3级）的咒流效果，并提示“你身上涌出古怪的疲乏感。”\n\n每1点扭曲值增加2秒的夜视效果，并提示“你的感觉猛地膨胀开来。”\n 持续300秒，每15点扭曲值增加1级（最多3级）的死亡凝视效果，并提示“你的视野突然变得诡异而模糊。”\n\n每1点扭曲生成1只无伤害心魔蜘蛛，并提示“它们到处都是！快跑！”\n\n提示“冥冥之中的一道目光在注视着你，也许是时候罢手了。”\n\n每30点扭曲生成1只邪术守卫，并提示“浓雾凭空而生，其间鬼影绰绰。”\n\n低概率：减少1点普通扭曲，并提示“有那么一瞬间，你感到头脑无比清晰。”\n 持续300秒，每15点扭曲值增加1级（最多3级）的反常之饥效果，并提示“突如其来的反常饥饿感让你感到劳累。”\n\n生成1座小型血腥传送门，并提示“那微弱的咏唱声在附近依稀可闻。”\n\n每1点扭曲生成1只有伤害的心魔蜘蛛，并提示“它们到处都是！快跑！”\n\n每15点扭曲生成1只邪术守卫，并提示“浓雾凭空而生，其间鬼影绰绰。”\n\n扭曲值分为三种：\n§5临时扭曲§r\n临时扭曲可以由食用僵尸之脑，在研究台进行邪术学研究，使用邪术珍品和血腥宝典，被邪术守卫和邪术典狱官的死亡凝视看到而获得。\n在扭曲发作时会必定减少的扭曲，也是在使用驱邪肥皂之后无论如何都会被清除的扭曲。\n\n§5扭曲/黏性扭曲§r\n普通扭曲为一般的，常规的扭曲，它可以由食用僵尸之脑，在研究台进行邪术学研究，使用邪术珍品和解锁邪术研究获得。\n在扭曲发作时，有概率减少，使用驱邪肥皂在苛刻的条件下才有几率减少不超过2点的扭曲。\n\n§5永久扭曲§r\n永久扭曲是不可磨灭的，直击灵魂的扭曲，它不可被消除。\n但是这个扭曲的来源也很简单,解锁禁忌知识（在魔导手册上有紫色烟雾环绕的研究）获得。\n无论如何，这个扭曲值都不会被减少，在这个整合包中，也只有一种方式能减少你的永久扭曲，不过这都是在大后期的事情了。\n\n§5装备扭曲§r\n理论上来说，装备扭曲属于可以人为增减的永久扭曲，它在你手持或装备护甲时得到，在你切换掉这个物品或脱掉护甲又会消失。",
      "frame:8": "ROUNDED_SQUARE",
      "globalshare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 5,
        "OreDict:8": "",
        "id:8": "thaumcraft:curio"
      },
      "ignoresview:1": 0,
      "ismain:1": 0,
      "issilent:1": 0,
      "lockedprogress:1": 0,
      "name:8": "扭曲，扭曲的效果",
      "questlogic:8": "AND",
      "repeat_relative:1": 1,
      "repeattime:3": -1,
      "simultaneous:1": 0,
      "snd_complete:8": "minecraft:entity.player.levelup",
      "snd_update:8": "minecraft:entity.player.levelup",
      "tasklogic:8": "AND",
      "visibility:8": "NORMAL"
    }
  },
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}