{
  "preRequisites:11": [
    37
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "Card Effects (Consumes Inspiration):\n\nExperiment (1): A random subject receives 15-30% completion, with basic studies gaining 1-10%.\n*Analysis (2)**: Converts 1 point of Observation research into 25-50% completion for the chosen subject, and 5% for another subject.\nGive Up (0): Retain the current completion of a subject without drawing any related cards, with basic studies gaining 5%.\nReflection (-1): All subjects lose an average of 10% completion, basic studies gain 1-10%, the player gains 1 inspiration, and an additional card draw opportunity.\n*Contemplation (2)**: All subjects gain 25% completion on average, basic studies gain 5%, and the player gets an extra card draw opportunity.\nAnnotation (1): Lose all completion for a subject and transfer 50-100% of the lost completion to another subject.\nInspiration (2): The subject with the highest current completion gains 10% + half of its current completion.\nResearch (1): A subject gains 15-25% completion.\nGeneral Theory (1): Distribute all current completions evenly across subjects, with basic studies gaining 5%, and an additional subject receiving full completion.\nResearch Trinket (1): Consume a Trinket, with basic studies and a random subject gaining 5% completion, and the Trinket\u0027s corresponding discipline gaining 25-35%.\nResearch Enchantment (1): Consume 5 levels of experience, granting 15-20% completion in Arcane Enchanting and Mystical Studies.\nAura Effect (-2): The player gains 2 inspirations and an extra card draw, with another subject achieving full completion.\nAstronomical Research (1): Consume two Astronomical Notes, with the subject with the highest current completion gaining 25-50%. Different note types have different special effects.\nDay: An additional subject receives full completion.\nMoon: Gain an extra card draw opportunity.\nStar: Gain 0-10% completion in Forbidden Magic, with up to 5 points of temporary warp.\nConcentration (1): Gain 15% completion in Alchemy and an extra card draw opportunity, with a 33% chance of gaining 1 inspiration.\nReaction (1): Gain 25% completion in Alchemy, with a 33% chance of gaining 1 inspiration.\nSynthesis (1): Combine two fragments into the corresponding compound fragment, gaining 40% completion in Alchemy, with a 33% chance of gaining 1 inspiration.\nMeasurement (1): Gain 15% completion in Arcane Enchanting and an extra card draw opportunity.\nEnchanting Experiment (1): Consume Item X and a Source Essence Ampoule to gain 10 + 1.5 * √(total source content of Item X)% completion in Arcane Enchanting.\nGuidance (1): Gain 25% completion in Arcane Enchanting.\nCalibration (1): Gain 15% completion in Transmutation and an extra card draw opportunity.\nAdjustment (1): Gain 3 * √(total source content of an item) ~ 3 * √(total source content of an item) + 10 % completion in Transmutation.\nConsciousness Beyond Matter (1): Consume Item X, gaining 10 + √(total source content of Item X)% completion in Transmutation.\nSpell Binding (1): Lose up to 5 levels of experience, gaining 5% completion in Mystical Studies for each level lost.\nCognition (1): Gain 20% completion in Mystical Studies, with a 33% chance to gain 1-5% Forbidden Magic completion and 1 point of regular warp.\nFocus (1): Gain 15% completion in Mystical Studies and an extra card draw opportunity.\nSculpture (1): Consume 1 Clay Ball, gaining 20% completion in Golemancy and an extra card draw opportunity.\nScript Writing (1): Consume 1 Paper and 1 Ink, gaining 25% completion in Golemancy.\nCollaboration (1): Alchemy, Transmutation, and Arcane Enchanting lose 15% completion each, with Golemancy gaining 30% completion. One extra subject gains full completion.\nWhispers of Darkness (1): Consume all player experience levels, gaining 0.2level ~ 0.5level % completion in Forbidden Magic. The player gains √(level) points of regular warp, with a 50% chance to gain √(level)% random subject completion and a 50% chance to draw an extra card.\nResearch Runes (1): Gain 10-20% Forbidden Magic completion, 10-20% random subject completion, with the player gaining 5 points of temporary warp.\nEpiphany (1): Gain 15% Forbidden Magic completion, two random subjects gain 5-10% completion each, with the player gaining 5 points of temporary warp, and a 50% chance to gain 1 point of regular warp.\nEnlightenment (1): Gain 30% Forbidden Magic completion and 5-10% random subject completion, with the player gaining 5 points of temporary warp and 1 point of regular warp.\nSeeking Truth (1): Gain 10-25% Forbidden Magic completion and an extra card draw opportunity, with the player gaining 3 points of temporary warp.\nOtherworldly Echoes (-1): Forbidden Magic and two random subjects gain 5-10% completion each, gaining 1 inspiration and 2 extra card draws. The player gains 5 points of temporary warp and 1 point of regular warp.\nGaining Inspiration (-1): 10 to 35 points in the first selected branch, 1 inspiration, and an additional branch choice, consuming 5 points of Source Essence.\nGaining Madness (-1): Gain a certain amount of Forbidden Magic branch points (increases with selection count), gaining 1 inspiration and an additional branch choice, consuming 10 points of Source Essence.\nFixing Matter/Energy (1): Gain 10-25% progress in Energy Studies.\nVat Rift (1): Three random branches gain 10-30% progress each. Two extra subjects gain full completion.\nRift Monitor (1): Gain 20-40% progress in Forbidden Magic, without generating warp.\nSource: mcmod.cn, Author: Non-toxic Cookie",
      "icon:10": {
        "Count:3": 1,
        "id:8": "thaumcraft:scribing_tools"
      },
      "name:8": "Research Content"
    }
  },
  "questID:3": 40,
  "rewards:9": {
    "0:10": {
      "choices:9": {
        "0:10": {
          "Count:3": 16,
          "id:8": "minecraft:paper"
        },
        "1:10": {
          "Count:3": 1,
          "Damage:2": 1,
          "id:8": "thaumcraft:curio"
        },
        "2:10": {
          "Count:3": 1,
          "id:8": "minecraft:dye"
        }
      },
      "index:3": 0,
      "rewardID:8": "bq_standard:choice"
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}