{
  "preRequisites:11": [
    88,
    200
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "To unlock Alchemy, the first step is to craft a Cauldron. Before using the Cauldron, we need to understand the concept of the Aether Field.\n\nIn TC6, the Aether system is different from the node-based system in TC4. The Aether in TC6 naturally fills every chunk, and your arcane activities are no longer limited by nodes. The unit of Aether is Vis, with a minimum precision of 0.1.\n\nVis is primarily used in casting spells and crafting. Many arcane recipes require Vis for crafting, and Vis will slowly regenerate under normal conditions. Unlike TC4’s wand Vis, which was divided into elemental types, TC6 Vis is unified, making the construction of magical crystal farms much easier. Each chunk has a unique Aether threshold, beyond which Aether can slowly spread to neighboring chunks.\n\nThe Aether threshold is the maximum amount of Aether that can naturally regenerate within a chunk. Each chunk has its own fixed threshold, and this cannot be altered. When you are in a Magical Forest biome, the Aether threshold is larger, meaning the area will have more abundant Aether and will regenerate faster.\n\nWhen holding the Thaumaturge Lens, you can observe the Aether levels in the chunk in the top-left corner of the interface. By sneaking, you can view the precise amount of Aether in the chunk.\n\nIf the remaining sources in the Cauldron are not processed in time or if they are improperly cleared, Thaumic Waves may occur.\n\nThaumic Waves are considered \"polluted Aether.\" They affect the regeneration of Aether in the chunk, and if severe, they can create rifts. Rifts can destroy surrounding blocks (including chests, ME drives, etc.) and devour any dropped items. When Thaumic Waves occur, you can clearly see purple star-shaped clouds rising into the sky.\n\nAlthough direct contact with these clouds doesn’t have immediate effects, the presence of these clouds signifies that polluted Aether has already been released into the chunk’s Aether field. Thaumic Waves can also slowly spread to neighboring chunks, at a faster rate than normal Aether.\n\nThe maximum Thaumic Wave value in a chunk is 32,766. When holding the Thaumaturge Lens, you can see the Thaumic Wave amount as a deep purple bar on top of the light pink Aether bar.\n\nAbout Rifts: When the Thaumic Wave value of a chunk exceeds 75% of the Aether threshold, a Thaumic Rift can spawn. Every additional 50 Thaumic Waves increases the chance of the Rift appearing by 1%. Once a Rift enters a block, it will destroy it. If a mob approaches a Rift, it will continuously take 2 points of Void damage. There are many ways to destroy Thaumic Rifts, but currently, none are achievable, so in the early stages, you will have to wait for the Rift to naturally disappear after absorbing all the Thaumic Waves. However, when a Rift disappears naturally, it usually means that Corrupted Spores have spawned. These are the source of pollution, difficult to kill, and they spread corruption, so don’t let them appear in your base!\n\nYou can use Quartz Fragments to process excess sources in the Cauldron, so make sure you have plenty of Quartz. The small amount of Quartz available in the overworld will only help you make a few Quartz Fragments, so to create more, head to the Nether.\n\nFor more details, check out the relevant chapters",
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 1,
        "id:8": "thaumicaugmentation:rift_seed",
        "tag:10": {
          "flux:3": 1000,
          "grown:1": 1
        }
      },
      "name:8": "Aether and Thaumic Waves"
    }
  },
  "questID:3": 96,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 64,
          "Damage:2": 9,
          "id:8": "thaumcraft:nugget"
        }
      }
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 128,
          "Damage:2": 9,
          "id:8": "thaumcraft:nugget"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}