{
  "preRequisites:11": [
    256
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "As you progress through your gameplay, you may occasionally hear an eerie sound, followed by the message: \"§5Your body feels twisted§r\" on your screen. This indicates that your \"mind\" has accumulated additional Warp.\n\nWarp is not a good thing—it frequently disrupts your gameplay by applying strange debuffs or hindering your focus. Below, we refer to these disruptive events as \"Warp Surges.\"\n\nWarp Surge Effects\nWarp Surges vary based on your Warp value (temporary + regular + permanent). Most of the effects are negative, though a few beneficial ones may appear.\n\nCommon Warp Surge Effects:\nStrange Sounds and Feelings\n\nMessage: \"What\u0027s that noise? Is something following you?\"\nEffect: Applies Warp Flux for 250 seconds, with each 15 Warp points increasing its level (up to level 3).\nAdditional Message: \"A strange fatigue washes over you.\"\nUnlocking New Research\n\nOne-time event: Unlocks Purifying Bath Salts research.\nMessage: \"There must be a way to suppress these headaches!\"\nHysterical Hunger\n\nEffect: Applies Warped Hunger for 250 seconds. Each 15 Warp points increase its level (up to level 3).\nMessage: \"A sudden warped hunger makes you feel drained.\"\nHallucinations\n\nMessage: \"Something seems to be following you...\"\nEffect: Spawns a Warp Warden.\nAdditional Message: \"A thick mist emerges, ghostly figures within.\"\nBlindness and Light Sensitivity\n\nEffect: Applies a highly nearsighted Vision Blur effect.\nDaylight Punishment: Applies Daylight Scorn for 250 seconds, causing damage in bright light. Each 15 Warp points increases its level (up to level 3).\nMessage: \"Suddenly, the light becomes unbearable, burning your skin.\"\nWeakened Strength\n\nEffect: Applies Mining Fatigue for 60 seconds. Each 15 Warp points increases its level (up to level 3).\nMessage: \"You suddenly tire of destruction.\"\nEnhanced Vision\n\nEffect: Grants Night Vision for 2 seconds per Warp point.\nMessage: \"Your senses suddenly sharpen.\"\nHostile Creatures\n\nEffect: Spawns harmless Mental Spiderlings.\nMessage: \"They\u0027re everywhere! Run!\"\nWarning Sign\n\nMessage: \"An unseen gaze watches you. Perhaps it\u0027s time to stop.\"\nBlood Portal\n\nEffect: Spawns a Small Blood Portal, summoning hostile creatures.\nMessage: \"A faint chant echoes nearby.\"\n\nTypes of Warp:\n\n§5Temporary Warp§r\n\nGained through actions like consuming zombie brains, conducting Eldritch research, or using forbidden items (e.g., Blood Codex).\nAlways cleared during a Warp Surge or with Sanity Soap.\n\n§5Sticky Warp§r (Regular Warp)\n\nAccumulated through similar activities but persists longer than Temporary Warp.\nCan occasionally reduce during Warp Surges or with Sanity Soap under strict conditions (max reduction: 2 points).\n\n§5Permanent Warp§r\n\nA permanent, soul-deep corruption.\nGained by unlocking forbidden knowledge (research with a purple mist effect).\nCannot be removed except through highly advanced, late-game methods.\n\n§5Equipment Warp§r\n\nA unique, removable form of Warp.\nActive only when holding or wearing items or armor imbued with Warp.\n\nManaging Warp:\n\nSanity Soap: Effective at reducing Temporary Warp and occasionally Sticky Warp.\n\nPurifying Bath Salts: Unlockable research to suppress minor Warp effects.\nCareful planning is key to managing Warp, especially when permanent Warp begins to accumulate. Delving into forbidden knowledge always comes with a price.",
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 5,
        "id:8": "thaumcraft:curio"
      },
      "name:8": "Warp and Its Effects"
    }
  },
  "questID:3": 117,
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}