{
  "preRequisites:11": [
    239
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "The Magic Mirror is a powerful tool in the Thaumic Renaissance modpack, used for remote item transportation across different dimensions or locations. It allows you to send and receive items effortlessly, making it an invaluable asset for automating item transfer.\n\nHow to Use:\nPlace the First Mirror:\nBegin by placing one Magic Mirror at your starting location. This will serve as the \"sending\" mirror.\n\nLink with the Second Mirror:\nTake the second Magic Mirror and right-click it on the first placed mirror. Upon successful linking, the hand-held mirror will display a \"black hole\" pattern, indicating that the link is established.\n\nTransporting Items:\nOnce linked, you can throw items into the first mirror. The items will then be transferred through the magical connection and appear in the second mirror, at the linked location.\n\nAutomatic Re-linking:\nIf a Magic Mirror is dismantled and re-installed, it will automatically reconnect with the previously linked mirror, without needing to manually reset the connection.\n\nImportant Notes:\nPairing Limitation:\nEach Magic Mirror can only form a pair with one other mirror. You cannot link it to a third mirror. Once a connection is established, it is locked to the paired mirror.\n\nWarp Generation:\nEvery time you transfer 128 items, the Magic Mirror will generate 1 Warp point. Be mindful of this, as excessive use can accumulate Warp, which can lead to negative effects.\n\nUsage Warning:\nWarp:\nAs with other teleportation or transference systems, be cautious of the Warp generated by using the mirrors. Overuse of the system can lead to undesirable effects in your magical environment, so manage the number of items transferred carefully to avoid an excess of Warp.\nIn conclusion, the Magic Mirror is a fantastic tool for cross-dimensional item transfer and an essential device for efficient storage and item logistics. Just remember to monitor your Warp levels and manage the transportation amounts to prevent any unintended consequences.",
      "icon:10": {
        "Count:3": 1,
        "id:8": "thaumcraft:mirror"
      },
      "name:8": "Remote Item Transport"
    }
  },
  "questID:3": 246,
  "rewards:9": {
    "0:10": {
      "index:3": 0,
      "rewardID:8": "bq_standard:item",
      "rewards:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "thaumcraft:mirror"
        }
      }
    },
    "1:10": {
      "choices:9": {
        "0:10": {
          "Count:3": 1,
          "id:8": "thaumcraft:goggles"
        },
        "1:10": {
          "Count:3": 1,
          "id:8": "thaumcraft:mirror"
        },
        "2:10": {
          "Count:3": 8,
          "id:8": "thaumcraft:mirrored_glass"
        }
      },
      "index:3": 1,
      "rewardID:8": "bq_standard:choice"
    }
  },
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredItems:9": {
        "0:10": {
          "Count:3": 2,
          "id:8": "thaumcraft:mirror"
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  }
}